# Primera Clase
En esta clase se trato los topicos basicos de SQL, y como se puede trabajar a través de iPython

## Primera parte:
### Manipulacion de Bases de Datos
En estra primera parte se vió el tema de como hacer la conexión a MySQL a traves de iPython

01. Esta primera linea carga la extension en iPython para luego poder usar los comandos 

    * `%sql` para comandos de una sola linea y el comando 
    * `%%sql` para los comandos de mas de una linea

In [1]:
%load_ext sql

02. Esta segunda linea ejecuta en sql la linea de coneccion con MySQL a través del módulo _pymysql_ enviando el usuario y la contraseña requeridos y la direccion de la base de datos.
    + `mysql`: Indica que la conección se hará con MySQL
    + `pymysql`: Indica que la coneccion se hará a través del módulo pymysql de Python
    + `root`: Es el usuario con el cual se conectará a MySQL
    + `qwe123`: Es my contraseña para el usuario root :) :P
    + `localhost`: Es el lugar donde se encuentra la base de datos, en este caso es la misma máquina

In [2]:
%sql mysql+pymysql://root:qwe123@localhost

C:\ProgramData\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xEDfico,...' for column 'VARIABLE_VALUE' at row 518")
  result = self._query(query)

'Connected: root@None'

## Ejercicios

01. Creación de las 2 bases de datos `db1` y `db2`

In [3]:
%%sql
create database db1;
create database db2;

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[]

02. Aquí se le indica a MySQL que se desea usar la base de datos `db1` para realizar las operaciones

In [4]:
%%sql
use db1;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

03. Aquí se hace lo mismo que en la celda anterior simplemente que se cambia de la base de datos `db1` a la base de datos `db2`

In [5]:
%%sql
use db2;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

04. El comando `drop` se usa para eliminar, en este caso se combina con el comando `database` para eliminar las bases de datos `db1` y `db2`

In [6]:
%%sql
drop database db1;
drop database db2;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

## Segunda Parte
### Tablas
En esta parte se explica como se pueden manipular tablas, para crearlas, adicionar columnas, modificar sus propiedades y eliminarlas

01. Administrar primero la base de datos a usar

In [7]:
%%sql 
drop database if exists sqldemo;
create database sqldemo;
use sqldemo;

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.
0 rows affected.

[]

02. Creacion de una tabla vacía, con los campos
    1. **id**: Entero, no se permiten nulos, de incremento automatico y usado como clave primaria
    2. **snn**: Texto de 11 caracteres
    3. **phone**: Texto de 14 caracteres
    4. **city**: Texto de 30 caracteres
    5. **maritalstatus**: Texto de 10 caracteres
    6. **fullname**: Texto de 40 caracteres
    7. **birhday**: Fecha

In [8]:
%%sql
create table persons (
    id            int not null auto_increment primary key,
    snn           varchar(11),
    phone         varchar(14),
    city          varchar(30),
    maritalstatus varchar(10),
    fullname      varchar(40),
    birthday      date
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

#### Ejercicios

* Describir lo que devuelve el comando `show tables`

In [9]:
%sql show tables;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('persons',)]

Este comando retorna todas las tablas que se encuentran disponibles en la base de datos seleccionada, en nuestro caso solo una, que tiene como nombre **persons**

* Describir lo que devuelve el comando `show create table persons`

In [10]:
%sql show create table persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('persons', 'CREATE TABLE `persons` (\n  `id` int(11) NOT NULL AUTO_INCREMENT,\n  `snn` varchar(11) DEFAULT NULL,\n  `phone` varchar(14) DEFAULT NULL,\n  `city` v ... (83 characters truncated) ...  varchar(40) DEFAULT NULL,\n  `birthday` date DEFAULT NULL,\n  PRIMARY KEY (`id`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci')]

Esta linea devuelve la estructura con la cual fue creada la tabla en la base de datos

* Describir lo que devuelve el comando `describe persons`

In [11]:
%sql describe persons;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('snn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

Esta linea devuelve la estructura de la tabla, es decir sus columnas y las propiedades de cada una de ellas

03. Modificacion de una tabla

    Aqui se estudia la forma en la cual se pueden hacer modificaciones a la estructura de la tabla como adicionar o eliminar columnas y modificar las propiedas de las columnas ya existentes

* Adicionar una nueva columna

In [12]:
%%sql 
alter table persons add state varchar(20) after city;
describe persons

 * mysql+pymysql://root:***@localhost
0 rows affected.
8 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('snn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('state', 'varchar(20)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

* Modificar el tamaño de la columna state de 20 a 25 caracteres

In [13]:
%%sql
alter table persons modify state varchar(25);
describe persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.
8 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('snn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('state', 'varchar(25)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

* Eliminacion de una de las columnas

In [14]:
%%sql
alter table persons drop state;
describe persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.
7 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('snn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

* Eliminacion de una tabla completa

In [15]:
%sql drop table persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]